import math


a = 1
b = 1
print(a is b)                       # True
# 140717074670376 140717074670376 140717074670376
print(id(a), id(b), id(1))
print(a is 1)                       # True


# python 内部的 intern 机制：对于整数和字符串来说，会进行复用

a = 1000000000000000000000000000000000000000000000
b = 1000000000000000000000000000000000000000000000
print(id(a), id(b))

a = [1, 2, 3, 4, 5]
b = [1, 2, 3, 4, 5]
print(a == b)                       # True
print(a is b)                       # False
print(id(a), id(b))                 # 2235218674816 2235218685696

# == 是判断值是否相等，is 是判断 id 是否相等
